test/src/test/testtool/EsbSoapValidator/12d/in.xml

<SOAPENV:Envelope xmlns:SOAPENV="http://schemas.xmlsoap.org/soap/envelope/">
	<SOAPENV:Header>
		<ns0:MessageHeader xmlns:ns0="http://nn.nl/XSD/Generic/MessageHeader/1">
			<ns0:From2>
				<ns0:Id>portal</ns0:Id>
			</ns0:From2>
			<ns0:To>
				<ns0:Location>TIBCO Service</ns0:Location>
			</ns0:To>
			<ns0:HeaderFields>
				<ns0:CPAId>cpid</ns0:CPAId>
				<ns0:ConversationId>ConversationId</ns0:ConversationId>
				<ns0:MessageId>MessageId</ns0:MessageId>
				<ns0:ExternalRefToMessageId>ExternalRefToMessageId</ns0:ExternalRefToMessageId>
				<ns0:Timestamp>2010-10-20T12:19:35</ns0:Timestamp>
			</ns0:HeaderFields>
			<ns0:Service>
				<ns0:Name>Document</ns0:Name>
				<ns0:Context>SalesDocument</ns0:Context>
				<ns0:Action>
					<ns0:Paradigm>Request</ns0:Paradigm>
					<ns0:Name>GetDocuments</ns0:Name>
					<ns0:Version>1</ns0:Version>
				</ns0:Action>
			</ns0:Service>
		</ns0:MessageHeader>
	</SOAPENV:Header>
	<SOAPENV:Body>
		<SetPolicyDetails_Request xmlns="http://nn.nl/XSD/PropertyCasualtyRetail/Log/LogConversion/1/SetPolicyDetails/1">
			<PolicyDetail>
				<FORECAST>a</FORECAST>
				<RVS_PARTY_ID>a</RVS_PARTY_ID>
				<COMPANY_CODE>a</COMPANY_CODE>
				<RVS_PAYLOAD>a</RVS_PAYLOAD>
				<NN_NOTIFY_PAYLOAD>a</NN_NOTIFY_PAYLOAD>
				<NN_COMPRODOC_PAYLOAD>String</NN_COMPRODOC_PAYLOAD>
				<NN_POLICY_NUMBER>String</NN_POLICY_NUMBER>
				<NN_POLICY_START_DATE>1967-08-13</NN_POLICY_START_DATE>
				<NN_PARTY_ID>String</NN_PARTY_ID>
				<STATUS>String</STATUS>
				<ERROR_REASON>String</ERROR_REASON>
				<BRE_PAYLOAD>String</BRE_PAYLOAD>
				<NN_PREMIUM>1234567891.12</NN_PREMIUM>
				<RVS_POLICY>
					<RVS_POLICY_NUMBER>a</RVS_POLICY_NUMBER>
					<RVS_POLICY_SEQNUM>a</RVS_POLICY_SEQNUM>
					<RVS_POLICY_VERSION>a</RVS_POLICY_VERSION>
					<RVS_BRANCH_CODE>a</RVS_BRANCH_CODE>
					<RVS_POLICY_TYPE>a</RVS_POLICY_TYPE>
					<RVS_PREMIUM>1234567891.12</RVS_PREMIUM>
					<STATUS>String</STATUS>
					<ERROR_REASON>String</ERROR_REASON>
				</RVS_POLICY>
				<RVS_POLICY>
					<RVS_POLICY_NUMBER>a</RVS_POLICY_NUMBER>
					<RVS_POLICY_SEQNUM>a</RVS_POLICY_SEQNUM>
					<RVS_POLICY_VERSION>a</RVS_POLICY_VERSION>
					<RVS_BRANCH_CODE>a</RVS_BRANCH_CODE>
					<RVS_POLICY_TYPE>a</RVS_POLICY_TYPE>
					<RVS_PREMIUM>1234567891.12</RVS_PREMIUM>
					<STATUS>String</STATUS>
					<ERROR_REASON>String</ERROR_REASON>
				</RVS_POLICY>
				<RVS_POLICY>
					<RVS_POLICY_NUMBER>a</RVS_POLICY_NUMBER>
					<RVS_POLICY_SEQNUM>a</RVS_POLICY_SEQNUM>
					<RVS_POLICY_VERSION>a</RVS_POLICY_VERSION>
					<RVS_BRANCH_CODE>a</RVS_BRANCH_CODE>
					<RVS_POLICY_TYPE>a</RVS_POLICY_TYPE>
					<RVS_PREMIUM>1234567891.12</RVS_PREMIUM>
					<STATUS>String</STATUS>
					<ERROR_REASON>String</ERROR_REASON>
				</RVS_POLICY>
			</PolicyDetail>
			<PolicyDetail>
				<FORECAST>a</FORECAST>
				<RVS_PARTY_ID>a</RVS_PARTY_ID>
				<COMPANY_CODE>a</COMPANY_CODE>
				<RVS_PAYLOAD>a</RVS_PAYLOAD>
				<NN_NOTIFY_PAYLOAD>a</NN_NOTIFY_PAYLOAD>
				<NN_COMPRODOC_PAYLOAD>String</NN_COMPRODOC_PAYLOAD>
				<NN_POLICY_NUMBER>String</NN_POLICY_NUMBER>
				<NN_POLICY_START_DATE>1967-08-13</NN_POLICY_START_DATE>
				<NN_PARTY_ID>String</NN_PARTY_ID>
				<STATUS>String</STATUS>
				<ERROR_REASON>String</ERROR_REASON>
				<BRE_PAYLOAD>String</BRE_PAYLOAD>
				<NN_PREMIUM>1234567891.12</NN_PREMIUM>
				<RVS_POLICY>
					<RVS_POLICY_NUMBER>a</RVS_POLICY_NUMBER>
					<RVS_POLICY_SEQNUM>a</RVS_POLICY_SEQNUM>
					<RVS_POLICY_VERSION>a</RVS_POLICY_VERSION>
					<RVS_BRANCH_CODE>a</RVS_BRANCH_CODE>
					<RVS_POLICY_TYPE>a</RVS_POLICY_TYPE>
					<RVS_PREMIUM>1234567891.12</RVS_PREMIUM>
					<STATUS>String</STATUS>
					<ERROR_REASON>String</ERROR_REASON>
				</RVS_POLICY>
				<RVS_POLICY>
					<RVS_POLICY_NUMBER>a</RVS_POLICY_NUMBER>
					<RVS_POLICY_SEQNUM>a</RVS_POLICY_SEQNUM>
					<RVS_POLICY_VERSION>a</RVS_POLICY_VERSION>
					<RVS_BRANCH_CODE>a</RVS_BRANCH_CODE>
					<RVS_POLICY_TYPE>a</RVS_POLICY_TYPE>
					<RVS_PREMIUM>1234567891.12</RVS_PREMIUM>
					<STATUS>String</STATUS>
					<ERROR_REASON>String</ERROR_REASON>
				</RVS_POLICY>
				<RVS_POLICY>
					<RVS_POLICY_NUMBER>a</RVS_POLICY_NUMBER>
					<RVS_POLICY_SEQNUM>a</RVS_POLICY_SEQNUM>
					<RVS_POLICY_VERSION>a</RVS_POLICY_VERSION>
					<RVS_BRANCH_CODE>a</RVS_BRANCH_CODE>
					<RVS_POLICY_TYPE>a</RVS_POLICY_TYPE>
					<RVS_PREMIUM>1234567891.12</RVS_PREMIUM>
					<STATUS>String</STATUS>
					<ERROR_REASON>String</ERROR_REASON>
				</RVS_POLICY>
			</PolicyDetail>
			<PolicyDetail>
				<FORECAST>a</FORECAST>
				<RVS_PARTY_ID>a</RVS_PARTY_ID>
				<COMPANY_CODE>a</COMPANY_CODE>
				<RVS_PAYLOAD>a</RVS_PAYLOAD>
				<NN_NOTIFY_PAYLOAD>a</NN_NOTIFY_PAYLOAD>
				<NN_COMPRODOC_PAYLOAD>String</NN_COMPRODOC_PAYLOAD>
				<NN_POLICY_NUMBER>String</NN_POLICY_NUMBER>
				<NN_POLICY_START_DATE>1967-08-13</NN_POLICY_START_DATE>
				<NN_PARTY_ID>String</NN_PARTY_ID>
				<STATUS>String</STATUS>
				<ERROR_REASON>String</ERROR_REASON>
				<BRE_PAYLOAD>String</BRE_PAYLOAD>
				<NN_PREMIUM>1234567891.12</NN_PREMIUM>
				<RVS_POLICY>
					<RVS_POLICY_NUMBER>a</RVS_POLICY_NUMBER>
					<RVS_POLICY_SEQNUM>a</RVS_POLICY_SEQNUM>
					<RVS_POLICY_VERSION>a</RVS_POLICY_VERSION>
					<RVS_BRANCH_CODE>a</RVS_BRANCH_CODE>
					<RVS_POLICY_TYPE>a</RVS_POLICY_TYPE>
					<RVS_PREMIUM>1234567891.12</RVS_PREMIUM>
					<STATUS>String</STATUS>
					<ERROR_REASON>String</ERROR_REASON>
				</RVS_POLICY>
				<RVS_POLICY>
					<RVS_POLICY_NUMBER>a</RVS_POLICY_NUMBER>
					<RVS_POLICY_SEQNUM>a</RVS_POLICY_SEQNUM>
					<RVS_POLICY_VERSION>a</RVS_POLICY_VERSION>
					<RVS_BRANCH_CODE>a</RVS_BRANCH_CODE>
					<RVS_POLICY_TYPE>a</RVS_POLICY_TYPE>
					<RVS_PREMIUM>1234567891.12</RVS_PREMIUM>
					<STATUS>String</STATUS>
					<ERROR_REASON>String</ERROR_REASON>
				</RVS_POLICY>
				<RVS_POLICY>
					<RVS_POLICY_NUMBER>a</RVS_POLICY_NUMBER>
					<RVS_POLICY_SEQNUM>a</RVS_POLICY_SEQNUM>
					<RVS_POLICY_VERSION>a</RVS_POLICY_VERSION>
					<RVS_BRANCH_CODE>a</RVS_BRANCH_CODE>
					<RVS_POLICY_TYPE>a</RVS_POLICY_TYPE>
					<RVS_PREMIUM>1234567891.12</RVS_PREMIUM>
					<STATUS>String</STATUS>
					<ERROR_REASON>String</ERROR_REASON>
				</RVS_POLICY>
			</PolicyDetail>
		</SetPolicyDetails_Request>
	</SOAPENV:Body>
</SOAPENV:Envelope>